InformationRegisters/СтатусыОнлайнОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОнлайнОплат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоУспешногоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Реквизит необходим для обеспечения ограничения доступа</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаОнлайнОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОнлайнОплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыОнлайнОплат/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. ОнлайнОплаты.ДатаПоследнегоУспешногоОбмена.
//
Функция ДатаПоследнегоУспешногоОбмена(НастройкаОнлайнОплаты) Экспорт 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаОнлайнОплат", НастройкаОнлайнОплаты);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СтатусыОнлайнОплат.ДатаПоследнегоУспешногоОбмена КАК ДатаПоследнегоУспешногоОбмена
	               |ИЗ
	               |	РегистрСведений.СтатусыОнлайнОплат КАК СтатусыОнлайнОплат
	               |ГДЕ
	               |	СтатусыОнлайнОплат.НастройкаОнлайнОплаты = &НастройкаОнлайнОплаты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаПоследнегоУспешногоОбмена;
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции

// См. ОнлайнОплаты.ДатаПоследнегоУспешногоОбменаПоОрганизации.
//
Функция ДатаПоследнегоУспешногоОбменаПоОрганизации(Организация) Экспорт 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыОнлайнОплат.ДатаПоследнегоУспешногоОбмена КАК ДатаПоследнегоУспешногоОбмена
	|ИЗ
	|	РегистрСведений.СтатусыОнлайнОплат КАК СтатусыОнлайнОплат
	|ГДЕ
	|	СтатусыОнлайнОплат.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаПоследнегоУспешногоОбмена;
	КонецЕсли;
	
	Возврат Дата('00010101');
	
КонецФункции

// Обновляет значение реквизита Организация для статуса обмена для указанной настройки.
//
// Параметры:
//  НастройкаОнлайнОплаты  - СправочникСсылка.НастройкиОнлайнОплат - Настройка онлайн оплаты для которой надо обновить дату последнего успешного обмена.
//  Организация - СправочникСсылка.Организации - Значение которое необходимо записать в реквизит организация.
//
Процедура ОбновитьЗначениеРеквизитаОрганизация (НастройкаОнлайнОплаты, Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СтатусыОнлайнОплат.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи(НастройкаОнлайнОплаты));
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция ДанныеЗаписи(НастройкаОнлайнОплаты)
	
	ДанныеЗаписи = РегистрыСведений.СтатусыОнлайнОплат.СоздатьМенеджерЗаписи();
	ДанныеЗаписи.НастройкаОнлайнОплаты = НастройкаОнлайнОплаты;
	ДанныеЗаписи.Прочитать();
	
	Если Не ДанныеЗаписи.Выбран() Тогда 
		
		ЗначенияКлюча = Новый Структура();
		ЗначенияКлюча.Вставить("НастройкаОнлайнОплаты", НастройкаОнлайнОплаты);
		ЗначенияКлюча.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			НастройкаОнлайнОплаты, "Организация"));
		ЗначенияКлюча.Вставить("ДатаПоследнегоУспешногоОбмена", ТекущаяДатаСеанса());
		
		ДанныеЗаписи = РегистрыСведений.СтатусыОнлайнОплат.СоздатьКлючЗаписи(ЗначенияКлюча);
		
	КонецЕсли;
	
	Возврат ДанныеЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
